#### Terraform Format and Style 🖌 `failure`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 Success! The configuration is valid.


#### Terraform Plan 📖 `success`

<details open><summary>Show Plan</summary>

```hcl
terraform
spectrocloud_cluster_profile.azure: Refreshing state... [id=60994137dba160e4381dcbca]
spectrocloud_cluster_profile.prod-gcp: Refreshing state... [id=60994137dba160e4359d13d4]
spectrocloud_cluster_profile.prodvmware: Refreshing state... [id=60994137dba160e43b8ac08f]
spectrocloud_cluster_gcp.cluster: Refreshing state... [id=60994137dba160e44621af39]
spectrocloud_cluster_azure.cluster: Refreshing state... [id=609949e1dba160e84e5217ff]
spectrocloud_cluster_vsphere.prod-vmware-2: Refreshing state... [id=60a26ae02bfeb0af334ab667]
spectrocloud_cluster_vsphere.prod-vmware-1: Refreshing state... [id=60a26ae02bfeb0af34eebd4b]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # spectrocloud_cluster_vsphere.prod-vmware-2 has been deleted
  - resource "spectrocloud_cluster_vsphere" "prod-vmware-2" {
      - cloud_account_id   = "609946e4dba160e6c97aa130" -> null
      - cluster_profile_id = "60994137dba160e43b8ac08f" -> null
      - id                 = "60a26ae02bfeb0af334ab667" -> null
      - kubeconfig         = <<-EOT
            apiVersion: v1
            clusters:
            - cluster:
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUN5ekNDQWJPZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1EVXhOekV6TURRMU9Gb1hEVE14TURVeE5URXpNRGsxT0Zvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBT1pxCnVoMHdtQTBUdlJWSnJjeUFXTEt3elFoMW1Ba2hLVXltemZoNnJsYzRDSWxhY2ZWaG9FMTl6Y3A3b3FmMi8wMWYKVGl1bGtQUVFFcGFMdjdTUC9LMDBQcUhaNFZ1OXppN2p5WC82SWE5bnpuT1pHQ0FMRVlaR21zaktNdXUrbmptVAp1WG0vanA3VUw5bHZqM0Q4U1h4VkN4M3Y0UC9WY05OU0VuSFptSVJydzVzMnR1emwySS9XSXdDZUtsVGJBQjJzClN6ZGtRZTkyejhMSWxCMGl6OStKb2g5SVZiQ2tPWEh5VGlMWFJSYTJCb25heFM2KzJ0TlN6V2F1bmJWMkZzblIKTXlERUZLTTlQdUlsd3hlclY3MkduWWg0MzhHWjRhOUVPWGIyOVJJcmVrc1VLaVlTZmp3NXd5c3U3SjFJU0wyMQpnc3dZUVVhU1JuSGFuZ2pBZXY4Q0F3RUFBYU1tTUNRd0RnWURWUjBQQVFIL0JBUURBZ0trTUJJR0ExVWRFd0VCCi93UUlNQVlCQWY4Q0FRQXdEUVlKS29aSWh2Y05BUUVMQlFBRGdnRUJBRmpqekx1MWprSDdIQU5UN2s1ZDZQMlUKYzErai9GUUlGby9GVElwWUhBOWRCUkdnUjdXclkrU0lwTUhlQ3ZXdFhIYnh5cVlES3Qrc0QybGNBbG9UZzEyTgp0NmRpaGdSOTZmUmdPVWR2dUlTM1JqSVNQV0RuRlJ1K2lyQVBmZlFVMzdrUGNudE9mdHBqZ0JCaG9lNFFoRHdTCldWV3l3bmw1UjhacU1kNHhST05ZTVk4WkVyU0lndW5vRzMrY1pjVUxrWFFsWkZtY2lUb2lIOWxkRCt5cjRtWi8KaGhsNUtPc01OampqempFNmxBQXJOWFNWaklJMjVERVJlTlFSTzdnNFdjWDRWTzlCeURNZTFENFgyVmR5YUppNgpQbG9xMzE4OEFvdnNYZVh6REdYeEp5Um8xUjBGd01KQVZaeWdEeENDWkJ6QzJVVGQzZWUwMmpFRGF0V1puaUE9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                server: https://vmware-prod-2-bl0g.spectrocloud.local:6443
              name: vmware-prod-2
            contexts:
            - context:
                cluster: vmware-prod-2
                user: vmware-prod-2-admin
              name: vmware-prod-2-admin@vmware-prod-2
            current-context: vmware-prod-2-admin@vmware-prod-2
            kind: Config
            preferences: {}
            users:
            - name: vmware-prod-2-admin
              user:
                client-certificate-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM4akNDQWRxZ0F3SUJBZ0lJU3g5a0hjdzd2RkV3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TVRBMU1UY3hNekEwTlRoYUZ3MHlNakExTVRjeE16QTVOVGxhTURReApGekFWQmdOVkJBb1REbk41YzNSbGJUcHRZWE4wWlhKek1Sa3dGd1lEVlFRREV4QnJkV0psY201bGRHVnpMV0ZrCmJXbHVNSUlCSWpBTkJna3Foa2lHOXcwQkFRRUZBQU9DQVE4QU1JSUJDZ0tDQVFFQXlHUEZNMjF0eG9NK3BLTWQKSGcrYXJkV1JmblpMb3MraS9vd1k0OS9WMDJCZ1F1cGZsbThLc1U1UnpueVh4aDIxUHNvQWZFZ094cWMra08ybgpiTUdWT0FlSmdrZk1lZ3NQY1lhbDM3VnIxV0xQNEZxMjdoOCtZdHBacUczTnVzaTB3TzFROVR6N1BjakNoUFJ4ClVjNWl3ZHovRjBJMlpUUC9FQzVIelZ3aDRBVDNKQXNTbnFsQWhXRDVqdzIvM1dXdktHTGVrbm5qc2dwS3ZXQXoKbTlremNUOGRGbHcxQzFEb3M4MnZRSUtET1JpTlV1T1VJdWhqNlFDRmE1d1ZCYnlyckMvTTFVa29hTkRhZVhHRAptTW85bVZpT0tCNjVqNGRlLy9FRzBXWGNOcUFMemoxVENGMjZkM3g1S2ltVVkwbWJTeHM3V2FYZmVSa2pDM2liCnhWVGJld0lEQVFBQm95Y3dKVEFPQmdOVkhROEJBZjhFQkFNQ0JhQXdFd1lEVlIwbEJBd3dDZ1lJS3dZQkJRVUgKQXdJd0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQkFENkNvd0QrUnJwdERZUlh2T1FXQWR1THNxTVE1Qnp2TFUyegprcHZEclJNSVZMaTRiblpuMmdabytEa2tJNmNPTzRPRGMwM0VMNGFDNENnc2hMRm1WcWpZeldmNi9ibjlCTEhtCnN0V1VlLzBOMUFCKzB5UC9NaWF0ODBqZVF1ZEo3dDNTWWdXYmRzVDFaemYxTTkvL1FzNmtYUno5Ti9WRDM1Y2YKSkpiOVFvUm5uQUlBUURRaE5HdWs3cXV4QXJtdTJtc3VJTS9tUlg1UkQ1dGlmWmMzd2lkTzRrVDhIc3E1UCt4dgpDV3o5ZTBKOU5ZRCtMWERieUgzbEc5MzdXcXhTaThkdkcyT09hMC9sVm9uNm1sb3dUSzQxSjVHSTR4RkhoRjZLCnVWUGlNRE15SWxVZWFjRG1Bc3d0bjF6VTZmNnlXTG5ranB3bEdWakh6SndTWk4xaTNjWT0KLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=
                client-key-data: LS0tLS1CRUdJTiBSU0EgUFJJVkFURSBLRVktLS0tLQpNSUlFcEFJQkFBS0NBUUVBeUdQRk0yMXR4b00rcEtNZEhnK2FyZFdSZm5aTG9zK2kvb3dZNDkvVjAyQmdRdXBmCmxtOEtzVTVSem55WHhoMjFQc29BZkVnT3hxYytrTzJuYk1HVk9BZUpna2ZNZWdzUGNZYWwzN1ZyMVdMUDRGcTIKN2g4K1l0cFpxRzNOdXNpMHdPMVE5VHo3UGNqQ2hQUnhVYzVpd2R6L0YwSTJaVFAvRUM1SHpWd2g0QVQzSkFzUwpucWxBaFdENWp3Mi8zV1d2S0dMZWtubmpzZ3BLdldBem05a3pjVDhkRmx3MUMxRG9zODJ2UUlLRE9SaU5VdU9VCkl1aGo2UUNGYTV3VkJieXJyQy9NMVVrb2FORGFlWEdEbU1vOW1WaU9LQjY1ajRkZS8vRUcwV1hjTnFBTHpqMVQKQ0YyNmQzeDVLaW1VWTBtYlN4czdXYVhmZVJrakMzaWJ4VlRiZXdJREFRQUJBb0lCQVFDRDlsL283QWs4anpWegppZzhrdXJYc0FCYWVKeHpNRE55VHNJSzduYTNjVXoxUkU3TDdDQWtNbGp6OU04Tm5MaTByT2k5enFLaENYZVN2CjRERS9SNFFTcjdQNFhYdmthdUF5cks4VFVRL0FLQ0FvNk5SS243eWZzSmNXZWFqZmRrakNQQVh5V2NSQi9iRkwKaVFZUEQxQ3R4ZkVleWZXMFU3ZUdXbFBpZ3Vlejg2YUp2K1JpWTNmOGV3YlNOY3UvQnd0MEpQdExrUmpJdUpGagpGY241MnRrbGhuRkJHNStRbGZIaEwzOHRuczNQc01qTUZjZ241WmVnRmdjRUwxdFZCcktNVjlzWUdTQ3hvOFRKCnJPSzBRRnlURXhnamlPK0ROZTNCNXc5ZVVYWlNTVGVKYXREUDZFQ1Z1QlBEWGc1aEgvUVJBTXVuS3FUdGNqeWIKZDhlK2pZaWhBb0dCQU96S2RqYk5pZkh6dHRWaVEzWlFOZkVsd2JwWDZ2aGZ6OTUzTkZUeWhneTVGemxLOXdIKwpsc3NIWTMxd3c1TUZDVW9tOC83TDNGQ0JUK0pyNE4wcFpIN3dJaXBFMFlVQmpPN0k1OFVaTDZMaVlZUnhuTTExCjhaSDhVQWM4Q2ZxVUE3MFlJaDBhVGt6eEpNOVJ5UWlFVUV3U0RGUHVyT202VERYeUo0RHY0cG5UQW9HQkFOaWwKV2JIMkVOVFR4ZlFHcUZpdkxxam8vWGM0dzd1aHFFME5QbTMvT1FLZzlCYnp2TXR2QktDSUkrbnBxdDVxemp4OAp4UUVWejlrbFZ4TFBZc1NGeWZ1VUVqM0kvcnZjY3ZmamNoOHp1Q203TGE5ejJrWkkxeUJ6UzBvc0Z4VHlJakxkClBkT2dLTEdrL2xYUjljb05SbEhLby95OGtTMnhSL3dZa1M4QzdFYTVBb0dCQUsrQmROTXp6djI5ZFJOOXJLRUIKM0tsckljYjdLUmFFOVc1ZmpqTTBPclV0YnhBeEJ4bThXSW9OWk9seDdoT0hWUlpYL3Rzb3dKZ084R1hUTGF6ZQo1RFROeVpUb3d4N0JRbk11QjlObjBvMzVHdXh1eFJqb1JXKzl3cGRLSWQ5UFcrSUpCQ2ZyK29NKzdOaVpOdGNRCk11L2ZKTElGSXJadU5kUjZNbHQzOGMydkFvR0FSUTVmeXVRZWRWaVRycmM0amh3NUNVcExFT2VkTEgvWS84YUsKOGRENndTWEE2RmdGQSt0OVZCWlJMRXg1VkxCQzBQRU1jczRiRktKY1lQaU9DUXFFV1piWFFhNkIxQ3Z1MGFsRQpSVUhkSUNBejdjdEY5a1ZkblZCaTNWKzBjODdDcStmdHZ6azcvM1FTUmhUSS9nREJPMjBXWElkVzEzTzgrRlIwCllzSFJ3ckVDZ1lBaUdaemJ3c0ZMZEhQQUxZRmVVNzArZllUcDFVTmh5elc2eDYrVkVUNHlLUW9oK1dtWTdBU2wKMlRRd05ZV0FsMGZoTlR1MGhNczVIM2U3OG1KdzJKQnRzTTQ1M0c4SEk4OXRxRmtwT2YzMWdzY0tpRCttVEEyZApTRzd5ckpqVmFSTkx5Y24xOVRCRy84OUcxSGwyVDZ6c0xTSTQyRUNQTXdsU2NXRlpaSitUQkE9PQotLS0tLUVORCBSU0EgUFJJVkFURSBLRVktLS0tLQo=
        EOT -> null
      - name               = "vmware-prod-2" -> null

      - cloud_config {
          - datacenter            = "Datacenter" -> null
          - folder                = "Demo/spc-prod-vmware-2" -> null
          - network_search_domain = "spectrocloud.local" -> null
          - network_type          = "DDNS" -> null
          - ssh_key               = <<-EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDAUaBODDNpQxJJqXz/Q+afauM5EPFp4oDRrWzK/cGd92N+exkd+tEZdO7n3R+WAx0XTcPiVvfKctzekNS6f/ZMrFb5HAPvFJtnGNIE2sm+eryEnAH+Sc7ppZha3/MaSp/A2dm2IobYRvwl04sEi4w1K+I8Rtt+fBe3gV3wnP3E3yOiRx4G2XFC3T6x8MjdOkjO2v6fBluw1M1H2etp1m/n4D70UkeyVJyipcntz0ubHweU7yPNdNS3YkpExYIGhm97C4dyESHEw9PZVdLs1FBL6mW5Yb4qVbg5FkLljLFynh9jL8IAYal0pibAAH+Sk/Nd4865lVJ3lrm8nhBnjs1OEFA487rcxyInxJk/WwLEHvo88Ku9IlYq15Alr8N/JHHackV4kAH0yJNeLtwAysK2gI7Mb5uGnMTPrz73IZqXSxFqnU34Ow+vwu8fXBtXmHA5cUHyz0ARzpgx8A0e8L8SjdY/6dsFhSzGo7JoCElN7sEMo7iI4Wdo8CYdlT+OXizBf3pnM/wxRZclCeRDJpLtd6jl5swv7J5ocINEh1r3BllCyV8L7Xp5gw8IKT3ohz6rliGJwwlq/emqY52eB3wweTLRm30z3h3aQa3YeAR+2JgvWlrJ3YWsYYCLRhSQTfYmpgUkoZIcfB2xkZzp6cyooM0i5Obz313HsxwBHOmNrw== spectro@spectro
            EOT -> null
          - static_ip             = false -> null
        }

      - machine_pool {
          - control_plane           = false -> null
          - control_plane_as_worker = false -> null
          - count                   = 1 -> null
          - name                    = "worker-basic" -> null
          - update_strategy         = "RollingUpdateScaleOut" -> null

          - instance_type {
              - cpu          = 4 -> null
              - disk_size_gb = 65 -> null
              - memory_mb    = 8192 -> null
            }

          - placement {
              - cluster   = "cluster3" -> null
              - datastore = "datastore56_2" -> null
              - id        = "60a26ae02bfeb0af38cfee2b" -> null
              - network   = "VM Network" -> null
            }
        }
      - machine_pool {
          - control_plane           = true -> null
          - control_plane_as_worker = true -> null
          - count                   = 1 -> null
          - name                    = "master-pool" -> null
          - update_strategy         = "RollingUpdateScaleOut" -> null

          - instance_type {
              - cpu          = 2 -> null
              - disk_size_gb = 61 -> null
              - memory_mb    = 4096 -> null
            }

          - placement {
              - cluster   = "cluster3" -> null
              - datastore = "datastore56_2" -> null
              - id        = "60a26ae02bfeb0af35d5b2c2" -> null
              - network   = "VM Network" -> null
            }
        }

      - pack {
          - name   = "lb-metallb" -> null
          - tag    = "0.8.x" -> null
          - values = <<-EOT
                manifests:
                  metallb:
                
                    #The namespace to use for deploying MetalLB
                    namespace: "metallb-system"
                
                    #MetalLB will skip setting .0 & .255 IP address when this flag is enabled
                    avoidBuggyIps: true
                
                    # Layer 2 config; The IP address range MetalLB should use while assigning IP's for svc type LoadBalancer
                    # For the supported formats, check https://metallb.universe.tf/configuration/#layer-2-configuration
                    addresses:
                    - 10.10.182.20-10.10.182.29
            EOT -> null
        }
    }
  # spectrocloud_cluster_vsphere.prod-vmware-1 has been deleted
  - resource "spectrocloud_cluster_vsphere" "prod-vmware-1" {
      - cloud_account_id   = "609946e4dba160e6c97aa130" -> null
      - cluster_profile_id = "60994137dba160e43b8ac08f" -> null
      - id                 = "60a26ae02bfeb0af34eebd4b" -> null
      - kubeconfig         = <<-EOT
            apiVersion: v1
            clusters:
            - cluster:
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUN5ekNDQWJPZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1EVXhOekV6TURVek9Gb1hEVE14TURVeE5URXpNVEF6T0Zvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBSytHClNvckx4TXMydWg3NUk4UWJhdmpoOUEwODZLTDZRSmhROWI3OEZ1UW1kZkNpK0w3NGJoc0k2aHBGZTE2VndpeGoKem9Ybys1dXFxejBKaUlPZnZSdU11S1NHTCtCeWJIZXpxc3lQUU0zeEVCams4NnYzWVMzM3dGaitVZzNCM2JkYQpCQUJJT2Zldk5ZQzJaNlVaZjIwTTNCMHVNSUw3WmwvWElyRlJGVXF3NXZ3WnZqRCtsQVpNUFROZ0kvNXFkV2VCCmJ4aTA0dmFQZXVhTHUvLzZ0MmU5RGxtOXJ5UHpXaE9kenlSaXYvOXVBZm1GS3RDSVFXVU1GbjFQelhxWnltMTEKWWM0eUM5UE16b2tqVC9qTHdjeThFTzdmL1NBMDRYNit3WEptWmkxNndLZjR3SmllRzRsS25VUUdiYlhaUDNTWgoyOStnRkhrYkxkRitkTFVLSVhjQ0F3RUFBYU1tTUNRd0RnWURWUjBQQVFIL0JBUURBZ0trTUJJR0ExVWRFd0VCCi93UUlNQVlCQWY4Q0FRQXdEUVlKS29aSWh2Y05BUUVMQlFBRGdnRUJBS29MdzN3aWllU3diSXZCcTdiK2hac3IKV2RkSWlXeTlJT0dBZ1lIRlB6WldNeFV4YUxGbEJ3RlF1T0EzUE9FdkQ0MXRheHRMTUNIdEU3ZFJyNUJtdVE0cQptRCtyMzdYZG9ZZXlDNDA0SVFjMjJNUW5LbU9DQW1lNUJDQllGNW9qL3lJRFladENDRW9vQnY4blhwS01EWTh5Cis5eU1mdHJGZEZ4dDl2SmcyOGdRZ2oxNTJPQVpBWkM0cDlHK1hZWXlTYUdIcTN5UU5OTDVGVlNabEFxTjVoOHUKUHJHME5TZ1dqSTJyV0FlZTlOYjBpVjJKOEdTbkR5ZkJkUFp1dkNWTWRKRlgzL1pBbzNjUUJKZWVWS3hXMU9JUApNblJ1OXFFOVdUb1BCREVqR2ZOb0pobW5pcUx6bXoxdDlSOXJJRVVmeWxpNHVDdDZzdDNWUW5Jam9zamZOZnc9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                server: https://vmware-prod-1-3g4t.spectrocloud.local:6443
              name: vmware-prod-1
            contexts:
            - context:
                cluster: vmware-prod-1
                user: vmware-prod-1-admin
              name: vmware-prod-1-admin@vmware-prod-1
            current-context: vmware-prod-1-admin@vmware-prod-1
            kind: Config
            preferences: {}
            users:
            - name: vmware-prod-1-admin
              user:
                client-certificate-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM4akNDQWRxZ0F3SUJBZ0lJWmFqbWlQWFZ3Q2d3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TVRBMU1UY3hNekExTXpoYUZ3MHlNakExTVRjeE16RXdNemxhTURReApGekFWQmdOVkJBb1REbk41YzNSbGJUcHRZWE4wWlhKek1Sa3dGd1lEVlFRREV4QnJkV0psY201bGRHVnpMV0ZrCmJXbHVNSUlCSWpBTkJna3Foa2lHOXcwQkFRRUZBQU9DQVE4QU1JSUJDZ0tDQVFFQW9CcElkMHFDdlFBYjBRME0KMStMd2RwSCtKSmJHUDJDSDUwMm1heTNId0o1Zm8zZitqUHRLYndoSWEyWVpadXVaeElJYWdLSHNhRmxsSW5YVwpaa1ZYb3JkMEh3Q2JkNEphQTgweUdiOHlTRmFqdkpnZGdxUzE3Ymk1dzFiTVdsTGQ0dmtoSkRMZDJteEx0QUlLClltM1VVc3hFQ05xSVBMalVya003VWxrNmpJNGxxNGVuNUFkOE5QQlA4WmdCL2dlS1Y3ZGNRWnRiMUROSHVVenoKTUlVeGtDR1ZHcmI1bEh0dUlLdk1FUGtBM3Z2NW1xK29VRittVnRlSzV4alBZRlB4OWgyTGpBVGN6NGQvWTk0QwpXVk9VZ0hQTTAydmFxUUhmVmxSSVVxTVdFWWJZbGNrVTJ5UjlVWWh1bFRTTlV0UHhseDY4K2o1MXlRbzhpLy9pCmpTWmNqUUlEQVFBQm95Y3dKVEFPQmdOVkhROEJBZjhFQkFNQ0JhQXdFd1lEVlIwbEJBd3dDZ1lJS3dZQkJRVUgKQXdJd0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQkFGai9CK3dscHNXaHQ0TjB5enkzUzY4VnpmRXV6azVMTnJiVworYjFoZlpaR3ROOHJ2YmhiYU1LVGE5d1M1ZVJNRWQzdklzSTkxNkJxT3RyZDdLZFZQbnF4VWh5UTA5Q0RBMmFaCjVYNkhHOWxlS0JqZzFxNkV1RmFLOFg5QmxhaFNLQk9IOElQUlpFR2xtcTR0ZDJSQ2R4bWhXYnRMRUYzMGhjaEoKYmhHQlo3Z2tUREpianRWYTRVN1h2TG9YTWlYbW16YS8zV0pHK09BN0JCeVRLdVRzRFlrd25FWXhzSHEwa0YwbQowYy8vQWc1c2Z3cWxIN1c4TUEyYWZIVnlGbFBNdis2bGl3UUxubFF0Y2tJZmZqTE1mbW5aK3QxcFJkbUg5WEVkCjVDNUZKeHpFSHF3aFozeHZvSkN0SS94WHJ1K3pTc1FIcHJNK2xPZG9YdHdVY2VsekZSMD0KLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=
                client-key-data: LS0tLS1CRUdJTiBSU0EgUFJJVkFURSBLRVktLS0tLQpNSUlFcEFJQkFBS0NBUUVBb0JwSWQwcUN2UUFiMFEwTTErTHdkcEgrSkpiR1AyQ0g1MDJtYXkzSHdKNWZvM2YrCmpQdEtid2hJYTJZWlp1dVp4SUlhZ0tIc2FGbGxJblhXWmtWWG9yZDBId0NiZDRKYUE4MHlHYjh5U0ZhanZKZ2QKZ3FTMTdiaTV3MWJNV2xMZDR2a2hKRExkMm14THRBSUtZbTNVVXN4RUNOcUlQTGpVcmtNN1VsazZqSTRscTRlbgo1QWQ4TlBCUDhaZ0IvZ2VLVjdkY1FadGIxRE5IdVV6ek1JVXhrQ0dWR3JiNWxIdHVJS3ZNRVBrQTN2djVtcStvClVGK21WdGVLNXhqUFlGUHg5aDJMakFUY3o0ZC9ZOTRDV1ZPVWdIUE0wMnZhcVFIZlZsUklVcU1XRVliWWxja1UKMnlSOVVZaHVsVFNOVXRQeGx4NjgrajUxeVFvOGkvL2lqU1pjalFJREFRQUJBb0lCQVFDUWprcWgwdGZxbUgrRgpLSGhSTUttWEZVaFhkdjgyMkF5OVRzSVZBYmZhOWVRNmI2eVpWSWNuYTE0Z0FvYXJBOHpKdmdMNTQ3blZtZW1UCnpMdXhpYWlQMVg1MlE1RWJ2Y2xTcDJJMkZ3anFnYmZESDhGOVpRU1N5SGlKcEFSTkJZY3NXVzZRQlpHRWxzVmYKbVh3UTFVT2hJcWZIS3JGWnlqVFZ4d1IzM1BMZFZrbUpHVzRBWVY1VTVRRWptTUV0QjRrK2Rqc0o5bS84TDMyUQp2bGh1eHhyK2NyUW1kc3VvQ2crNGZ1S1h4WDdPeVptOHdYbFNNUHF4eDVnK2IrSUgvcitWWllCS0x4aitRYXRtClU4OUlQaHZpcXE1eGpVZGwzaVd3NW8vUzNQSmZCNEFIMGZUWUtlK0FUNkhNQTdWMit5cUlmRUN3TVJtMGZYOGwKSFJmaTNPd3RBb0dCQU02VTlTZk9zcHdYQkNpbjhnKzM5T1hRRDFNYVdzbzJ2N0VzYWZvbm15cTVLbFcrMXU2eQp5bVRJQjlxeFFJQUpOb1pRSC9YamVXeTFvOStvNnlkYloyUGFkTDRqRm1yakxYMkFQWnp1Z1Z6NUQvUU9zK1EvCnZuYlV3Mkhzc3hEMTQ0alhSZmkvZTN6eUhTRTAzSWwrV2VvVGdRRDAxVU9wZEJpTTA4SEVEU1pIQW9HQkFNWm0KOGtWcE1ONXlINjMxV2N6YUtLMys4R0wzWjlmWmk4cGNicllneXdJV1NGQzl3T2p5Wkd4VFFHVDJDWncwMEY4Ngppa1YrdDlGQ1FYSzA2YnhhZGRFL1NsZm1mZXZzWGJRYU02NnNtdXJwUG4wYkxURkQ5K0NYU0c1dXRUM3FxMHd1CnFKS1p1Wi9oMnovQ09WNm1JbzNBZ255WFk4ZWJmYU5XdEkvcmJzeUxBb0dCQUxiL1h6aFhNd053cEI5N3ZzTkwKMnVabGE5M2EvOGdYdmJHdVBXYjdCTXBRNHY2NElsK3JBLzFJOFNRNlZuL1ZLWGJMcmJROVFNZ2JFOExDT1NWUgpKQUpoZDM4alIrMkJ0ejl3aGFQcDU3QzdkUFZtdk5hWjNSZ1pHOGM0VGR2ZFppVkhSZFcza2lXNXVESTlTSXVICjRSQ3BIR01EZjVRRG5UTk9OUnQxbDR4ckFvR0FZZzdwZVFMbmcxbjJiRjBTT0J3dTlPaEcyVE1jWU9PRm9zdVMKY0hPK3dsWlBBWkQzY21xeTFaTkVCV0pSRjZKR3hucEJjdDJSYmx5SHluQytBVGpZZUVZR3NYRWJGV3FxV1dTRgozTFEwa1J3Y3BXcTBLR0JHZC90dGNoOUhkc1d3U2lQWmJ6T0pPZ3MvK01BKzZKZkdCamQ2aHFld1NpeUFxU1VtCmN1ZFN5TWNDZ1lCMlhMdjVJRWFRcVFGL0FnOGtFdldyckkzZHA5REE1NDVVZDRRKzBZSVBaTUJEVjVacmg4UGwKbVRPZ2dHS090TGZPdHQ3Ry9FMlRVenBmbGI2UU5INCtIVkh5dGorV3Zod3REN2dPS0VCLzFoMWpoUThBMEQ5ZAozNmN1VSt2SEdpTXlCQWlva3llWDlmbGl4SmJieFc4WFdhMzdrUkphNkVHY3BPZG9sSlNBMHc9PQotLS0tLUVORCBSU0EgUFJJVkFURSBLRVktLS0tLQo=
        EOT -> null
      - name               = "vmware-prod-1" -> null

      - cloud_config {
          - datacenter            = "Datacenter" -> null
          - folder                = "Demo/spc-prod-vmware-1" -> null
          - network_search_domain = "spectrocloud.local" -> null
          - network_type          = "DDNS" -> null
          - ssh_key               = <<-EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDAUaBODDNpQxJJqXz/Q+afauM5EPFp4oDRrWzK/cGd92N+exkd+tEZdO7n3R+WAx0XTcPiVvfKctzekNS6f/ZMrFb5HAPvFJtnGNIE2sm+eryEnAH+Sc7ppZha3/MaSp/A2dm2IobYRvwl04sEi4w1K+I8Rtt+fBe3gV3wnP3E3yOiRx4G2XFC3T6x8MjdOkjO2v6fBluw1M1H2etp1m/n4D70UkeyVJyipcntz0ubHweU7yPNdNS3YkpExYIGhm97C4dyESHEw9PZVdLs1FBL6mW5Yb4qVbg5FkLljLFynh9jL8IAYal0pibAAH+Sk/Nd4865lVJ3lrm8nhBnjs1OEFA487rcxyInxJk/WwLEHvo88Ku9IlYq15Alr8N/JHHackV4kAH0yJNeLtwAysK2gI7Mb5uGnMTPrz73IZqXSxFqnU34Ow+vwu8fXBtXmHA5cUHyz0ARzpgx8A0e8L8SjdY/6dsFhSzGo7JoCElN7sEMo7iI4Wdo8CYdlT+OXizBf3pnM/wxRZclCeRDJpLtd6jl5swv7J5ocINEh1r3BllCyV8L7Xp5gw8IKT3ohz6rliGJwwlq/emqY52eB3wweTLRm30z3h3aQa3YeAR+2JgvWlrJ3YWsYYCLRhSQTfYmpgUkoZIcfB2xkZzp6cyooM0i5Obz313HsxwBHOmNrw== spectro@spectro
            EOT -> null
          - static_ip             = false -> null
        }

      - machine_pool {
          - control_plane           = false -> null
          - control_plane_as_worker = false -> null
          - count                   = 1 -> null
          - name                    = "general-compute" -> null
          - update_strategy         = "RollingUpdateScaleOut" -> null

          - instance_type {
              - cpu          = 4 -> null
              - disk_size_gb = 65 -> null
              - memory_mb    = 8192 -> null
            }

          - placement {
              - cluster   = "cluster2" -> null
              - datastore = "datastore55_2" -> null
              - id        = "60a26ae02bfeb0af36adecb5" -> null
              - network   = "VM Network" -> null
            }
        }
      - machine_pool {
          - control_plane           = false -> null
          - control_plane_as_worker = false -> null
          - count                   = 1 -> null
          - name                    = "gpu-basic" -> null
          - update_strategy         = "RollingUpdateScaleOut" -> null

          - instance_type {
              - cpu          = 4 -> null
              - disk_size_gb = 65 -> null
              - memory_mb    = 8192 -> null
            }

          - placement {
              - cluster   = "cluster2" -> null
              - datastore = "datastore55_2" -> null
              - id        = "60a26ae02bfeb0af372acf73" -> null
              - network   = "VM Network" -> null
            }
        }
      - machine_pool {
          - control_plane           = false -> null
          - control_plane_as_worker = false -> null
          - count                   = 2 -> null
          - name                    = "worker-basic" -> null
          - update_strategy         = "RollingUpdateScaleOut" -> null

          - instance_type {
              - cpu          = 4 -> null
              - disk_size_gb = 65 -> null
              - memory_mb    = 8192 -> null
            }

          - placement {
              - cluster   = "cluster2" -> null
              - datastore = "datastore55_2" -> null
              - id        = "60a26ae12bfeb0af3c8867f0" -> null
              - network   = "VM Network" -> null
            }
        }
      - machine_pool {
          - control_plane           = true -> null
          - control_plane_as_worker = true -> null
          - count                   = 3 -> null
          - name                    = "master-pool" -> null
          - update_strategy         = "RollingUpdateScaleOut" -> null

          - instance_type {
              - cpu          = 2 -> null
              - disk_size_gb = 61 -> null
              - memory_mb    = 4096 -> null
            }

          - placement {
              - cluster   = "cluster2" -> null
              - datastore = "datastore55_2" -> null
              - id        = "60a26ae02bfeb0af3bcecddb" -> null
              - network   = "VM Network" -> null
            }
        }

      - pack {
          - name   = "lb-metallb" -> null
          - tag    = "0.8.x" -> null
          - values = <<-EOT
                manifests:
                  metallb:
                
                    #The namespace to use for deploying MetalLB
                    namespace: "metallb-system"
                
                    #MetalLB will skip setting .0 & .255 IP address when this flag is enabled
                    avoidBuggyIps: true
                
                    # Layer 2 config; The IP address range MetalLB should use while assigning IP's for svc type LoadBalancer
                    # For the supported formats, check https://metallb.universe.tf/configuration/#layer-2-configuration
                    addresses:
                    - 10.10.182.10-10.10.182.19
            EOT -> null
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # spectrocloud_cluster_vsphere.prod-vmware-1 will be created
  + resource "spectrocloud_cluster_vsphere" "prod-vmware-1" {
      + cloud_account_id   = "609946e4dba160e6c97aa130"
      + cloud_config_id    = (known after apply)
      + cluster_profile_id = "60994137dba160e43b8ac08f"
      + id                 = (known after apply)
      + kubeconfig         = (known after apply)
      + name               = "vmware-prod-1"

      + cloud_config {
          + datacenter            = "Datacenter"
          + folder                = "Demo/spc-prod-vmware-1"
          + network_search_domain = "spectrocloud.local"
          + network_type          = "DDNS"
          + ssh_key               = <<-EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDAUaBODDNpQxJJqXz/Q+afauM5EPFp4oDRrWzK/cGd92N+exkd+tEZdO7n3R+WAx0XTcPiVvfKctzekNS6f/ZMrFb5HAPvFJtnGNIE2sm+eryEnAH+Sc7ppZha3/MaSp/A2dm2IobYRvwl04sEi4w1K+I8Rtt+fBe3gV3wnP3E3yOiRx4G2XFC3T6x8MjdOkjO2v6fBluw1M1H2etp1m/n4D70UkeyVJyipcntz0ubHweU7yPNdNS3YkpExYIGhm97C4dyESHEw9PZVdLs1FBL6mW5Yb4qVbg5FkLljLFynh9jL8IAYal0pibAAH+Sk/Nd4865lVJ3lrm8nhBnjs1OEFA487rcxyInxJk/WwLEHvo88Ku9IlYq15Alr8N/JHHackV4kAH0yJNeLtwAysK2gI7Mb5uGnMTPrz73IZqXSxFqnU34Ow+vwu8fXBtXmHA5cUHyz0ARzpgx8A0e8L8SjdY/6dsFhSzGo7JoCElN7sEMo7iI4Wdo8CYdlT+OXizBf3pnM/wxRZclCeRDJpLtd6jl5swv7J5ocINEh1r3BllCyV8L7Xp5gw8IKT3ohz6rliGJwwlq/emqY52eB3wweTLRm30z3h3aQa3YeAR+2JgvWlrJ3YWsYYCLRhSQTfYmpgUkoZIcfB2xkZzp6cyooM0i5Obz313HsxwBHOmNrw== spectro@spectro
            EOT
          + static_ip             = false
        }

      + machine_pool {
          + control_plane           = false
          + control_plane_as_worker = false
          + count                   = 1
          + name                    = "general-compute"
          + update_strategy         = "RollingUpdateScaleOut"

          + instance_type {
              + cpu          = 4
              + disk_size_gb = 65
              + memory_mb    = 8192
            }

          + placement {
              + cluster   = "cluster2"
              + datastore = "datastore55_2"
              + id        = (known after apply)
              + network   = "VM Network"
            }
        }
      + machine_pool {
          + control_plane           = false
          + control_plane_as_worker = false
          + count                   = 1
          + name                    = "gpu-basic"
          + update_strategy         = "RollingUpdateScaleOut"

          + instance_type {
              + cpu          = 4
              + disk_size_gb = 65
              + memory_mb    = 8192
            }

          + placement {
              + cluster   = "cluster2"
              + datastore = "datastore55_2"
              + id        = (known after apply)
              + network   = "VM Network"
            }
        }
      + machine_pool {
          + control_plane           = false
          + control_plane_as_worker = false
          + count                   = 2
          + name                    = "worker-basic"
          + update_strategy         = "RollingUpdateScaleOut"

          + instance_type {
              + cpu          = 4
              + disk_size_gb = 65
              + memory_mb    = 8192
            }

          + placement {
              + cluster   = "cluster2"
              + datastore = "datastore55_2"
              + id        = (known after apply)
              + network   = "VM Network"
            }
        }
      + machine_pool {
          + control_plane           = true
          + control_plane_as_worker = true
          + count                   = 3
          + name                    = "master-pool"
          + update_strategy         = "RollingUpdateScaleOut"

          + instance_type {
              + cpu          = 2
              + disk_size_gb = 61
              + memory_mb    = 4096
            }

          + placement {
              + cluster   = "cluster2"
              + datastore = "datastore55_2"
              + id        = (known after apply)
              + network   = "VM Network"
            }
        }

      + pack {
          + name   = "lb-metallb"
          + tag    = "0.8.x"
          + values = <<-EOT
                manifests:
                  metallb:
                
                    #The namespace to use for deploying MetalLB
                    namespace: "metallb-system"
                
                    #MetalLB will skip setting .0 & .255 IP address when this flag is enabled
                    avoidBuggyIps: true
                
                    # Layer 2 config; The IP address range MetalLB should use while assigning IP's for svc type LoadBalancer
                    # For the supported formats, check https://metallb.universe.tf/configuration/#layer-2-configuration
                    addresses:
                    - 10.10.182.10-10.10.182.19
            EOT
        }
    }

  # spectrocloud_cluster_vsphere.prod-vmware-2 will be created
  + resource "spectrocloud_cluster_vsphere" "prod-vmware-2" {
      + cloud_account_id   = "609946e4dba160e6c97aa130"
      + cloud_config_id    = (known after apply)
      + cluster_profile_id = "60994137dba160e43b8ac08f"
      + id                 = (known after apply)
      + kubeconfig         = (known after apply)
      + name               = "vmware-prod-2"

      + cloud_config {
          + datacenter            = "Datacenter"
          + folder                = "Demo/spc-prod-vmware-2"
          + network_search_domain = "spectrocloud.local"
          + network_type          = "DDNS"
          + ssh_key               = <<-EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDAUaBODDNpQxJJqXz/Q+afauM5EPFp4oDRrWzK/cGd92N+exkd+tEZdO7n3R+WAx0XTcPiVvfKctzekNS6f/ZMrFb5HAPvFJtnGNIE2sm+eryEnAH+Sc7ppZha3/MaSp/A2dm2IobYRvwl04sEi4w1K+I8Rtt+fBe3gV3wnP3E3yOiRx4G2XFC3T6x8MjdOkjO2v6fBluw1M1H2etp1m/n4D70UkeyVJyipcntz0ubHweU7yPNdNS3YkpExYIGhm97C4dyESHEw9PZVdLs1FBL6mW5Yb4qVbg5FkLljLFynh9jL8IAYal0pibAAH+Sk/Nd4865lVJ3lrm8nhBnjs1OEFA487rcxyInxJk/WwLEHvo88Ku9IlYq15Alr8N/JHHackV4kAH0yJNeLtwAysK2gI7Mb5uGnMTPrz73IZqXSxFqnU34Ow+vwu8fXBtXmHA5cUHyz0ARzpgx8A0e8L8SjdY/6dsFhSzGo7JoCElN7sEMo7iI4Wdo8CYdlT+OXizBf3pnM/wxRZclCeRDJpLtd6jl5swv7J5ocINEh1r3BllCyV8L7Xp5gw8IKT3ohz6rliGJwwlq/emqY52eB3wweTLRm30z3h3aQa3YeAR+2JgvWlrJ3YWsYYCLRhSQTfYmpgUkoZIcfB2xkZzp6cyooM0i5Obz313HsxwBHOmNrw== spectro@spectro
            EOT
          + static_ip             = false
        }

      + machine_pool {
          + control_plane           = false
          + control_plane_as_worker = false
          + count                   = 1
          + name                    = "worker-basic"
          + update_strategy         = "RollingUpdateScaleOut"

          + instance_type {
              + cpu          = 4
              + disk_size_gb = 65
              + memory_mb    = 8192
            }

          + placement {
              + cluster   = "cluster3"
              + datastore = "datastore56_2"
              + id        = (known after apply)
              + network   = "VM Network"
            }
        }
      + machine_pool {
          + control_plane           = true
          + control_plane_as_worker = true
          + count                   = 1
          + name                    = "master-pool"
          + update_strategy         = "RollingUpdateScaleOut"

          + instance_type {
              + cpu          = 2
              + disk_size_gb = 61
              + memory_mb    = 4096
            }

          + placement {
              + cluster   = "cluster3"
              + datastore = "datastore56_2"
              + id        = (known after apply)
              + network   = "VM Network"
            }
        }

      + pack {
          + name   = "lb-metallb"
          + tag    = "0.8.x"
          + values = <<-EOT
                manifests:
                  metallb:
                
                    #The namespace to use for deploying MetalLB
                    namespace: "metallb-system"
                
                    #MetalLB will skip setting .0 & .255 IP address when this flag is enabled
                    avoidBuggyIps: true
                
                    # Layer 2 config; The IP address range MetalLB should use while assigning IP's for svc type LoadBalancer
                    # For the supported formats, check https://metallb.universe.tf/configuration/#layer-2-configuration
                    addresses:
                    - 10.10.182.20-10.10.182.29
            EOT
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @jeremy-spectro, Action: `pull_request`, Working Directory: `sandbox`, Workflow: `Terraform Plan`*